# PhyMaterialParamStructuralSpecificHeat Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhyMaterialParamStructuralSpecificHeat Property
ParameterTypeId Class See Also
---
"Specific Heat"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhyMaterialParamStructuralSpecificHeat { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhyMaterialParamStructuralSpecificHeat As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhyMaterialParamStructuralSpecificHeat {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace